#### FabricationHostedInfo Members

---

|  |
| --- |
| FabricationHostedInfo Class   Methods   Properties   See Also |

The  FabricationHostedInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | DisconnectFromHost | Disconnects the part from the host. |
| Public method | Dispose | Releases all resources used by the  FabricationHostedInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBearerCenterline | Gets the centerline of the bearer. The method is applicable only for bearer hanger. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | PlaceOnHost(ElementId, Connector, Double) | Places the part on the specified host. |
| Public method | PlaceOnHost(ElementId, Connector, Double, Double) | Places the part on the specified host. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | HostId | Returns the Id of the host. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FabricationHostedInfo Class

Autodesk.Revit.DB Namespace